Revit 2027 API
ParameterTypeId.PanelId Property
 "Panel"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PanelId { get; }
Public Shared ReadOnly Property PanelId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PanelId {
	ForgeTypeId^ get ();
}
static member PanelId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace